# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'php'
brew 'php@7.3'
brew 'imagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'

# Apps
cask 'discord'
cask 'github'
cask 'brave-browser'
cask 'java'
cask 'phpstorm'
cask 'sequel-pro-nightly'
cask 'skype'
cask 'slack'
cask 'steam'
cask 'neo4j'
cask 'android-sdk'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Mac App Store
mas 'Giphy Capture', id: 668208984
mas 'The Unarchiver', id: 425424353
